In [1]:
import pandas as pd

# Example 1 - Using Lambda Function

In [2]:
data1 = { "outer_key1" : [ {"key1": "value11"},
                           {"key2": "value12"},
                           {"key3": "value13"}],
          "outer_key2" : [ {"key1": "value21"},
                           {"key2": "value22"},
                           {"key3": "value23"}] 
        }

data1

{'outer_key1': [{'key1': 'value11'}, {'key2': 'value12'}, {'key3': 'value13'}],
 'outer_key2': [{'key1': 'value21'}, {'key2': 'value22'}, {'key3': 'value23'}]}

In [3]:
# Solution 1

df = pd.DataFrame(data1).apply(lambda x  : pd.Series({ k: v for kv_pair in x for k, v in kv_pair.items()}))
df

     outer_key1 outer_key2
key1    value11    value21
key2    value12    value22
key3    value13    value23

In [4]:
# Solution 2

df = pd.Series(data1).apply(lambda x  : pd.Series({ k: v for kv_pair in x for k, v in kv_pair.items()}))
df

               key1     key2     key3
outer_key1  value11  value12  value13
outer_key2  value21  value22  value23

In [5]:
# To save the dataframe to a json file. Different parameters gives different views.
# Experiment with orient = "records" and orient = "index"

df.to_json("data1.json", orient="index", indent=4)

# Example 2 - Using GroupBy

In [6]:
data2 = { "outer_key1" : [ {"key1": "value11"},
                           {"key1": "value12"},
                           {"key1": "value13"}],
          "outer_key2" : [ {"key1": "value21"},
                           {"key1": "value22"},
                           {"key1": "value23"}] 
        }

data2

{'outer_key1': [{'key1': 'value11'}, {'key1': 'value12'}, {'key1': 'value13'}],
 'outer_key2': [{'key1': 'value21'}, {'key1': 'value22'}, {'key1': 'value23'}]}

In [7]:
# Here, we are basically converting a nested dictionary into a list of simple dictionaries. 
# This is then passed to a DataFrame function to generate a dataframe.

rows = [] 
  
# appending rows 
for outer_key in data2: 
    data_row = data2[outer_key] 
      
    for row in data_row: 
        row['outer_key'] = outer_key
        rows.append(row) 

        
df = pd.DataFrame(rows) 
df

      key1   outer_key
0  value11  outer_key1
1  value12  outer_key1
2  value13  outer_key1
3  value21  outer_key2
4  value22  outer_key2
5  value23  outer_key2

In [8]:
# Experiment 1

df_group = df.groupby(['outer_key'])
df_group.count()

            key1
outer_key
outer_key1     3
outer_key2     3

In [9]:
# Experiment 2

df_group = df.groupby(['outer_key', 'key1'])
df_group.count()

Empty DataFrame
Columns: []
Index: [(outer_key1, value11), (outer_key1, value12), (outer_key1, value13), (outer_key2, value21), (outer_key2, value22), (outer_key2, value23)]

# Example 3 - Using Pivot Table

In [10]:
data3 = {
        "Student1": [{"Exam": "Math", "Score": 89}, 
                    {"Exam": "Science", "Score": 99}, 
                    {"Exam": "History", "Score": 75}, 
                   ],  
        "Student2": [{"Exam": "Math", "Score": 60}, 
                    {"Exam": "Science", "Score": 59}, 
                    {"Exam": "History", "Score": 70}, 
                   ],
        }

data3

{'Student1': [{'Exam': 'Math', 'Score': 89},
  {'Exam': 'Science', 'Score': 99},
  {'Exam': 'History', 'Score': 75}],
 'Student2': [{'Exam': 'Math', 'Score': 60},
  {'Exam': 'Science', 'Score': 59},
  {'Exam': 'History', 'Score': 70}]}

In [11]:
rows = [] 
  
# appending rows 
for outer_key in data3: 
    data_row = data3[outer_key] 
      
    for row in data_row: 
        row['Students'] = outer_key
        rows.append(row) 

        
df = pd.DataFrame(rows) 
df

      Exam  Score  Students
0     Math     89  Student1
1  Science     99  Student1
2  History     75  Student1
3     Math     60  Student2
4  Science     59  Student2
5  History     70  Student2

In [12]:
df = df.pivot_table(index ='Students', columns =['Exam'], 
                        values =['Score']).reset_index() 
df

      Students   Score
Exam           History Math Science
0     Student1      75   89      99
1     Student2      70   60      59

In [13]:
df.columns = ['Students', 'History', 'Math', 'Science']
df

   Students  History  Math  Science
0  Student1       75    89       99
1  Student2       70    60       59

# References

https://stackoverflow.com/questions/49115118/nested-dictionary-to-pandas-dataframe <br>
https://www.geeksforgeeks.org/python-convert-list-of-nested-dictionary-into-pandas-dataframe/